In [23]:
import pandas as pd
Location = "Desktop/datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)

In [24]:
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [25]:
import pandas as pd
Location = "Desktop/datasets/gradedata.csv"
df1 = pd.read_csv(Location)

In [26]:
df1.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [27]:
import pandas as pd
Location = "Desktop/datasets/smallgrades.csv"
# To add headers as we load the data...
df2 = pd.read_csv(Location, names=['Names','Grades'])
# To add headers to a dataframe
df2.columns = ['Names','Grades']

In [28]:
df2.head()

     Names  Grades
0   Marcia    82.4
1   Kadeem    78.2
2     Nash    79.3
3  Noelani    83.2
4  Noelani    87.4

In [29]:
import pandas as pd
pd.read_csv("Desktop/Turn1.csv")

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,12097,50,12,97,36740,422,NaN,NaN,Osceola County,268685,128170,172493,72293,268685,172493
1,12007,50,12,7,99999,999,NaN,NaN,Bradford County,28520,11011,26088,9605,28520,26088
2,12027,50,12,27,11580,999,NaN,NaN,DeSoto County,34862,14590,32209,13608,34862,32209
3,12037,50,12,37,99999,999,NaN,NaN,Franklin County,11549,8652,11057,7180,11549,11057
4,12093,50,12,93,36380,999,NaN,NaN,Okeechobee County,39996,18509,35910,15504,39996,35910
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62,12067,50,12,67,99999,999,NaN,NaN,Lafayette County,8870,3328,7022,2660,8870,7022
63,12081,50,12,81,35840,494,NaN,NaN,Manatee County,322833,172690,264002,138128,322833,264002
64,12091,50,12,91,18880,999,NaN,NaN,Okaloosa County,180822,92407,170498,78593,180822,170498
65,12073,50,12,73,45220,999,NaN,NaN,Leon County,275487,124136,239452,103974,275487,239452
66,12115,50,12,115,35840,494,NaN,NaN,Sarasota County,379448,228413,325957,182467,379448,325957